In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha', 'beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557
2  Y  alpha -0.420123 -0.073434
3  Y   beta  1.366351  0.407326
4  Z  alpha -0.518065 -0.263341

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    0.451204
Y    0.473114
Z   -0.518065
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.230760
    JAN   -0.420123
NY  FEB    1.366351
    JAN    0.307552
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557
2  Y  alpha -0.420123 -0.073434
3  Y   beta  1.366351  0.407326
4  Z  alpha -0.518065 -0.263341

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.451204  0.355646
Y   0.473114  0.166946
Z  -0.518065 -0.263341

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.133169 -0.225265
   beta  -0.230760  0.936557
Y  alpha -0.420123 -0.073434
   beta   1.366351  0.407326
Z  alpha -0.518065 -0.263341

In [12]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [13]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557
2  Y  alpha -0.420123 -0.073434
3  Y   beta  1.366351  0.407326
4  Z  alpha -0.518065 -0.263341

In [16]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.420123 -0.073434
3  Y   beta  1.366351  0.407326


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.518065 -0.263341

In [19]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265


key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  -0.23076  0.936557


key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.420123 -0.073434


key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  1.366351  0.407326


key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.518065 -0.263341

In [18]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557
2  Y  alpha -0.420123 -0.073434
3  Y   beta  1.366351  0.407326
4  Z  alpha -0.518065 -0.263341

In [20]:
# Creating a dictionary with the data pieces
group_dict = dict(list(dframe.groupby('k1')))

In [21]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  1.133169 -0.225265
1  X   beta -0.230760  0.936557

In [22]:
# you can create a diction with axis 1
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [23]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.133169 -0.225265
 1 -0.230760  0.936557
 2 -0.420123 -0.073434
 3  1.366351  0.407326
 4 -0.518065 -0.263341, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [27]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()
#look at all of data set 2 and group 
#it by both keys and average all value that share it

          dataset2
k1 k2
X  alpha -0.225265
   beta   0.936557
Y  alpha -0.073434
   beta   0.407326
Z  alpha -0.263341